---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Width
zh: 宽度
source: html/47a7846f-c6e5-0207-f324-ed3d4e5814c1.htm
---
# Autodesk.Revit.DB.ConnectorElement.Width Property

**中文**: 宽度

The width of the connector.

## Syntax (C#)
```csharp
public virtual double Width { get; }
```

## Remarks
-1 if the connector is round.